package com.everbald.folobot.service

import com.everbald.folobot.extensions.isAboutBot
import com.everbald.folobot.service.nlp.TextRazorService
import org.springframework.stereotype.Service
import org.telegram.telegrambots.meta.api.objects.Message

@Service
class FreelanceService(
    private val textRazorService: TextRazorService,
    private val userService: UserService
) {
    companion object {
        const val TEXT_CATEGORY = "596"
    }

    fun isAboutFreelance(message: Message): Boolean =
        (message.isUserMessage || message.isAboutBot() || userService.isSelf(message.replyToMessage?.from))
            .and(
                (textRazorService.textAnalysis(message.text)?.response?.categories
                    ?.any { it.categoryId == TEXT_CATEGORY } == true
                        )
                    .or(
                        listOf(
                            "фриланс", "айти", "IT", "программ", "компил", "java", "kotlin", "джава", "котлин",
                            "C++", "C#", "перегрузка",
                            "программирование", "алгоритм", "кодирование", "разработка", "система", "база данных",
                            "сервер", "клиент", "сеть", "безопасность", "протокол", "пользователь", "приложение",
                            "веб-сайт", "мобильное приложение", "интерфейс", "облако", "интеграция",
                            "резервное копирование", "хакер", "робототехника", "интернет вещей",
                            "искусственный интеллект", "биг-дата", "аналитика", "виртуализация",
                            "системный администратор", "сайт", "фронтенд", "бэкенд", "библиотека", "фреймворк",
                            "программист", "тестирование", "отладка", "компилятор", "операционная система",
                            "криптография", "пароль", "электронная почта", "браузер", "хостинг", "API", "интернет",
                            "блокчейн", "компьютерная графика", "дизайн интерфейса", "системная архитектура",
                            "эксплойт", "классификация данных",
                            "переменная", "цикл", "функция", "класс", "метод", "объект", "массив", "условие", "логика",
                            "циклическая структура", "анализ кода", "отладка", "компиляция", "интерпретация",
                            "комментарий", "программный код", "инструкция", "библиотека", "фреймворк", "синтаксис",
                            "переполнение стека", "рекурсия", "программное обеспечение", "разработка интерфейса",
                            "абстракция", "полиморфизм", "наследование", "инкапсуляция", "инструмент разработки",
                            "программная архитектура", "алгоритм", "паттерн", "менеджер пакетов", "оператор", "операнд",
                            "дебаггер", "сложность кода", "проектирование баз данных", "SQL",
                            "интерфейс программирования", "разработка игр", "веб-разработка", "тестирование программ",
                            "GUI", "многопоточность", "баг", "рефакторинг", "агрегация данных", "буфер обмена",
                            "платформа разработки"
                        ).any {
                            message.text?.contains(it, true) == true
                        }
                    )
            )
}